# SlopeStartHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SlopeStartHeight Property
ParameterTypeId Class See Also
---
"Height Offset at Tail"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SlopeStartHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SlopeStartHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SlopeStartHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace